Repository: Liideli/BrainyBear
Catalog: BrainyBear/*.lproj/Localizable.strings
Languages: fi

source: Settings
fi: Asetukset

source: Map
fi: Kartta

source: Story
fi: Tarina

source: Draw
fi: Piirrä

source: Math
fi: Matikka

# storiesNav
source: Stories
fi: Tarinat

# next
source: Next Story
fi: Seuraava Tarina

source: Listen
fi: Kuuntele

source: Stop listening
fi: Lopeta kuuntelu

# title1
source: The Lion and the Mouse
fi: Leijona ja hiiri

# story1
source: Once upon a time, in a dense jungle, a mighty lion used to live. He was very proud of his strength and considered himself the king of the jungle. One day, while taking a stroll, he got trapped in a hunter's net. He roared loudly and tried to free himself, but all his efforts went in vain. He was struggling to break free when he saw a tiny mouse passing by. The lion called out to the mouse and asked for help.The mouse was surprised to see the mighty lion trapped in a net. Nevertheless, he decided to help the lion. The mouse quickly gnawed at the ropes and freed the lion.The lion was grateful to the mouse and thanked him. He realized that even the smallest creatures can be of great help in times of need. From that day on, the lion and the mouse became good friends. Moral of the story: Never underestimate the power of small acts of kindness.
fi: Olipa kerran, tiheässä viidakossa, mahtava leijona asui. Hän oli hyvin ylpeä vahvuudestaan ja piti itseään viidakon kuninkaana. Eräänä päivänä kävelyllä hän jäi loukkuun metsästäjän verkkoon. Hän karjui äänekkäästi ja yritti vapauttaa itsensä, mutta kaikki hänen ponnistelunsa menivät turhaan. Hän kamppaili päästäkseen irti, kun hän näki pienen hiiren kulkevan ohi. Leijona huusi hiirelle ja pyysi apua. Hiiri yllättyi nähdessään mahtavan leijonan jääneen verkkoon. Siitä huolimatta hän päätti auttaa leijonaa. Hiiri puri nopeasti köysiä ja vapautti leijonan. Leijona oli kiitollinen hiirelle ja kiitti häntä. Hän ymmärsi, että pienimmätkin olennot voivat olla suureksi avuksi hädän hetkellä. Siitä päivästä lähtien leijonasta ja hiirestä tuli hyviä ystäviä. Tarinan moraali: Älä koskaan aliarvioi pienten ystävällisyydentekojen voimaa.

# title2
source: The Tortoise and the Hare
fi: Kilpikonna ja jänis

# story2
source: Once upon a time, in a forest, there lived a slow and steady tortoise and a fast and overconfident hare. The hare would always boast about his speed and make fun of the tortoise for being slow. One day, the hare challenged the tortoise to a race. The tortoise accepted the challenge, and the race was fixed for the next day. On the day of the race, the hare ran ahead of the tortoise and decided to take a nap in the middle of the race, thinking that he could easily catch up with the tortoise later. Meanwhile, the tortoise continued to walk slowly but steadily towards the finish line. When the hare woke up, he was shocked to see the tortoise just a few steps away from the finish line. The hare ran as fast as he could, but it was too late. The tortoise had already crossed the finish line and won the race. The hare was ashamed of his overconfidence and apologized to the tortoise for making fun of him. From that day on, the hare learned to respect the tortoise and never boasted about his speed again. Moral of the story: Slow and steady wins the race.
fi: Olipa kerran metsässä hidas ja vakaa kilpikonna ja nopea ja liian itsevarma jänis. Jänis kerskui aina nopeudestaan ja pilkkasi kilpikonnaa hitaasta. Eräänä päivänä jänis haastoi kilpikonnan kilpailuun. Kilpikonna otti haasteen vastaan ja kilpailu sovittiin seuraavaksi päiväksi. Kisapäivänä jänis juoksi kilpikonnan edellä ja päätti ottaa torkut kesken kilpailun, koska hän ajatteli, että hän voisi helposti saada kilpikonnan myöhemmin kiinni. Samaan aikaan kilpikonna jatkoi kävelemistä hitaasti mutta tasaisesti kohti maaliviivaa. Kun jänis heräsi, hän oli järkyttynyt nähdessään kilpikonnan vain muutaman askeleen päässä maaliviivasta. Jänis juoksi niin nopeasti kuin pystyi, mutta oli liian myöhäistä. Kilpikonna oli jo ylittänyt maaliviivan ja voitti kilpailun. Jänis häpeäsi liiallista itseluottamustaan ja pyysi kilpikonnalta anteeksi, että tämä pilkkasi häntä. Siitä päivästä lähtien jänis oppi kunnioittamaan kilpikonnaa eikä enää koskaan kerskaillut nopeudestaan. Tarinan moraali: Hidas ja vakaa voittaa kilpailun.

# title3
source: Little Red Riding Hood
fi: Pieni Punahilkka

# story3
source: Once upon a time, there was a little girl called Little Red Riding Hood. She always wore a red hooded cloak that her grandmother had made for her, and because of this, everyone in the village called her Little Red Riding Hood. One day, Little Red Riding Hood's mother asked her to take some food to her sick grandmother, who lived in a cottage in the forest. Little Red Riding Hood happily agreed and set off on her journey through the forest. As she was walking, a sly wolf saw her and decided to follow her. He wanted to eat both Little Red Riding Hood and her grandmother. So, he quickly ran ahead and reached the grandmother's cottage before Little Red Riding Hood. When the wolf reached the cottage, he knocked on the door, pretending to be Little Red Riding Hood. The grandmother, who was in bed, thought it was her granddaughter and told the wolf to come in. The wolf then ate the grandmother and hid in her bed. A little while later, Little Red Riding Hood reached the cottage. She went in and found the wolf in her grandmother's bed. The wolf tried to eat Little Red Riding Hood too, but she was quick and managed to escape. She ran to a nearby woodcutter and told him about what had happened. The woodcutter quickly went to the cottage and saved Little Red Riding Hood and her grandmother by killing the wolf. From that day on, Little Red Riding Hood never wandered alone in the forest again, and the woodcutter became her protector. Moral of the story: Be careful of strangers, and always stay on the path that you know is safe.
fi: Olipa kerran pieni tyttö nimeltä Punahilkka. Hän käytti aina punahuppuista viittaa, jonka hänen isoäitinsä oli valmistanut hänelle, ja tämän vuoksi kaikki kylässä kutsuivat häntä Punahilkkaiseksi. Eräänä päivänä Punahilkan äiti pyysi häntä viemään ruokaa sairaalle isoäidilleen, joka asui metsämökissä. Punahilkka suostui iloisesti ja lähti matkalleen metsän halki. Kun hän käveli, viekas susi näki hänet ja päätti seurata häntä. Hän halusi syödä sekä Punahilkka että hänen isoäitinsä. Joten hän juoksi nopeasti eteenpäin ja saavutti isoäidin mökin ennen Punahilkkaa. Kun susi saapui mökille, hän koputti oveen teeskennellen olevansa Punahilkka. Sängyssä ollut isoäiti luuli sen olevan hänen tyttärentytäränsä ja käski suden tulla sisään. Sitten susi söi isoäidin ja piiloutui tämän sänkyyn. Vähän myöhemmin Punahilkka saapui mökille. Hän meni sisään ja löysi suden isoäitinsä sängystä. Susi yritti myös syödä Punahilkkaa, mutta hän oli nopea ja onnistui pakenemaan. Hän juoksi läheisen puunhakkurin luo ja kertoi hänelle tapahtuneesta. Puunhakkaaja meni nopeasti mökille ja pelasti Punahilkan ja hänen isoäitinsä tappamalla suden. Siitä päivästä lähtien Punahilkka ei enää koskaan vaeltanut yksin metsässä, ja puunhakkaajasta tuli hänen suojelijansa. Tarinan moraali: Ole varovainen vieraita kohtaan ja pysy aina tiellä, jonka tiedät olevan turvallinen.

# title4
source: The Lost Kitten
fi: Kadonnut kissanpentu

# story4
source: A tiny kitten got lost in the big city. She was scared and alone until a kind girl found her and took her home. The girl gave the kitten food and water and made her a cozy bed. The kitten was so happy to have found a new friend. The girl searched for the kitten's owner and eventually found them. But the kitten didn't want to leave her new friend. In the end, the owner decided to let the girl keep the kitten, and they lived happily ever after.
fi: Pieni kissanpentu eksyi suurkaupunkiin. Hän oli peloissaan ja yksin, kunnes ystävällinen tyttö löysi hänet ja vei hänet kotiin. Tyttö antoi kissanpennulle ruokaa ja vettä ja teki hänelle mukavan sängyn. Kissa oli niin iloinen saadessaan uuden ystävän. Tyttö etsi kissanpennun omistajaa ja lopulta löysi heidät. Mutta kissanpentu ei halunnut jättää uutta ystäväänsä. Lopulta omistaja päätti antaa tytön pitää kissanpennun, ja he elivät onnellisina elämänsä loppuun asti.

# title5
source: The Magic Seed
fi: Maaginen siemen

# story5
source: A little girl named Lily planted a seed in her garden. She watered it every day and waited patiently for it to grow. One day, a beautiful flower bloomed from the seed. But this was no ordinary flower; it was a magic flower that granted wishes. Lily wished for a trip to the beach, and suddenly she was transported to a beautiful sandy shore. She played in the waves and built sandcastles all day. When she was ready to go home, she wished again, and the flower brought her back to her garden. Lily learned that with a little bit of magic, anything is possible.
fi: Pieni tyttö nimeltä Lily istutti siemenen puutarhaansa. Hän kasteli sitä joka päivä ja odotti kärsivällisesti sen kasvamista. Eräänä päivänä siemenestä kukkasi kaunis kukka. Mutta tämä ei ollut tavallinen kukka; se oli maaginen kukka, joka täytti toiveet. Lily toivoi matkaa rannalle, ja yhtäkkiä hänet kuljetettiin kauniille hiekkarannalle. Hän leikki aalloissa ja rakensi hiekkalinnoja koko päivän. Kun hän oli valmis menemään kotiin, hän toivoi uudelleen, ja kukka toi hänet takaisin puutarhaansa. Lily oppi, että pienellä taikuudella kaikki on mahdollista.

# title6
source: The Enchanted Forest
fi: Lumottu metsä

# story6
source: In the heart of a dense forest, there lived a young girl named Emma. Emma was always curious about the forest and often explored its mysteries. One day, as she was wandering deep into the woods, she stumbled upon a hidden cottage. The door creaked open, and Emma walked inside. The cottage was filled with strange objects and a collection of books that told stories of the enchanted forest. As Emma read through the books, she began to feel a strange sensation. Suddenly, she realized that the stories were coming to life, and she was now in the middle of an enchanted forest. Emma had a magical adventure full of wonder and excitement. She eventually found her way back home, but she knew that she would always treasure her journey through the enchanted forest.
fi: Tiheän metsän sydämessä asui nuori tyttö nimeltä Emma. Emma oli aina utelias metsästä ja tutki usein sen mysteereitä. Eräänä päivänä, kun hän vaelsi syvälle metsään, hän törmäsi piilotettuun mökkiin. Ovi narsahti auki ja Emma käveli sisään. Mökki oli täynnä outoja esineitä ja kokoelma kirjoja, jotka kertoivat tarinoita lumotusta metsästä. Kun Emma luki kirjoja läpi, hän alkoi tuntea outoa tunnetta. Yhtäkkiä hän tajusi, että tarinat heräsivät henkiin, ja hän oli nyt keskellä lumottua metsää. Emmalla oli maaginen seikkailu täynnä ihmeitä ja jännitystä. Hän löysi lopulta tiensä takaisin kotiin, mutta hän tiesi, että hän aina arvostaisi matkaansa lumotun metsän läpi.

# title7
source: The Little Robot's Adventure
fi: Pienen robotin seikkailu

# story7
source: A little robot named Robby lived in a factory and dreamed of seeing the outside world. One day, he snuck out of the factory and went on an adventure. He explored the city and saw all kinds of new things, like tall buildings and colorful lights. But as night fell, Robby realized he was lost and didn't know how to get back to the factory. Luckily, a kind person found him and took him back to the factory. Robby realized that while it was fun to explore new places, he was happy to be back in the place he called home.
fi: Pieni robotti nimeltä Robby asui tehtaassa ja haaveili ulkomaailman näkemisestä. Eräänä päivänä hän hiipi ulos tehtaalta ja lähti seikkailuun. Hän tutki kaupunkia ja näki kaikenlaisia uusia asioita, kuten korkeita rakennuksia ja värikkäitä valoja. Mutta yön tullessa Robby tajusi olevansa eksyksissä eikä tiennyt kuinka päästä takaisin tehtaalle. Onneksi ystävällinen henkilö löysi hänet ja vei takaisin tehtaalle. Robby tajusi, että vaikka oli hauskaa tutustua uusiin paikkoihin, hän oli iloinen saadessaan palata kotiin kutsumaansa paikkaan.

# title8
source: The Talking Animals
fi: Puhuvat eläimet

# story8
source: In a land far away, there lived a group of talking animals. Each day, they would gather together and share stories and adventures from their lives. But one day, a new animal arrived in the village, and he couldn't talk. The other animals found it difficult to communicate with him, and he felt isolated and alone. The next day, the animals came up with a plan to help the new animal learn how to talk. They taught him new words and expressions and helped him practice every day. Soon enough, the new animal could talk like the rest of them. And the village became an even more inclusive and happy place.
fi: Kaukana olevassa maassa asui joukko puhuvia eläimiä. Joka päivä he kokoontuivat yhteen ja jakavat tarinoita ja seikkailuja elämästään. Mutta eräänä päivänä kylään saapui uusi eläin, joka ei voinut puhua. Muiden eläinten oli vaikea kommunikoida hänen kanssaan, ja hän tunsi olevansa eristetty ja yksinäinen. Seuraavana päivänä eläimet keksivät suunnitelman auttaa uutta eläintä oppimaan puhumaan. He opettivat hänelle uusia sanoja ja ilmaisuja ja auttoivat häntä harjoittelemaan joka päivä. Pian uusi eläin pystyi puhumaan kuten muutkin. Ja kylästä tuli entistä kattavampi ja onnellisempi paikka.

# title9
source: The Brave Little Turtle
fi: Rohkea pieni kilpikonna

# story9
source: In a forest, a little turtle was too scared to come out of his shell. All the other animals laughed at him and teased him. One day, a big fire broke out in the forest, and all the animals ran away. The little turtle realized he needed to be brave and face his fears. He crawled out of his shell and used his shell as a shield to protect himself from the fire. The other animals were amazed at his bravery and never laughed at him again.
fi: Metsässä pieni kilpikonna oli liian peloissaan tullakseen ulos kuorestaan. Kaikki muut eläimet nauroivat hänelle ja kiusoittivat häntä. Eräänä päivänä metsässä syttyi suuri tulipalo, ja kaikki eläimet pakenivat. Pieni kilpikonna tajusi, että hänen oli oltava rohkea ja kohdattava pelkonsa. Hän ryömi ulos kuorestaan ja käytti kuoriaan kilpenä suojautuakseen tulelta. Muut eläimet hämmästyivät hänen rohkeudestaan eivätkä enää koskaan nauraneet hänelle.

# title10
source: The Magical Circus
fi: Maaginen sirkus

# story10
source: A young girl named Emily loved the circus. She went every time it came to town and dreamed of running away to join the circus. One day, as she was walking through a field, she stumbled upon a strange circus tent. Inside, she found a magical circus filled with wonders and surprises. The circus was run by a group of talking animals who welcomed Emily with open arms. She spent the day learning how to juggle, dance on a tightrope, and perform all sorts of amazing tricks. Emily felt like she had finally found her true calling, and she knew that she would always remember the magical circus. As she left the tent, the talking animals wished her well and said goodbye with a promise to return again one day.
fi: Nuori tyttö nimeltä Emily rakasti sirkusta. Hän meni joka kerta, kun se tuli kaupunkiin, ja haaveili pakoon liittyäkseen sirkukseen. Eräänä päivänä, kun hän käveli pellolla, hän törmäsi oudoon sirkustelttaan. Sisältä hän löysi maagisen sirkuksen, joka oli täynnä ihmeitä ja yllätyksiä. Sirkusta johti joukko puhuvia eläimiä, jotka ottivat Emilyn vastaan avosylin. Hän vietti päivän opetellen jongleerausta, tanssia narulla ja tehdä kaikenlaisia hämmästyttäviä temppuja. Emily tunsi vihdoin löytäneensä todellisen kutsumuksensa, ja hän tiesi muistavansa aina maagisen sirkuksen. Kun hän poistui teltalta, puhuvat eläimet toivottivat hänelle kaikkea hyvää ja sanoivat hyvästit lupaamalla palata jonain päivänä.

# colorPick
source: Color
fi: Väri

source: Pencil
fi: Lyijykynä

source: Pen
fi: Kynä

source: Marker
fi: Tussi

source: Pick Color
fi: Valitse Väri

source: Add Canvas
fi: Lisää taideteos

source: Drawing
fi: Piirros

# titleCanvas
source: Masterpiece Title
fi: Taideteoksen otsikko

# addNewCanvas
source: Add New Masterpiece
fi: Lisää uusi taideteos

source: Reward store
fi: Kauppa

source: Buy item
fi: Osta esine

source: Cancel
fi: Peruuta

# doYouWant
source: Do you want to get
fi: Haluatko ostaa esineen

# notEnough
source: Not enough money to buy
fi: Ei tarpeeksi rahaa ostaa esineitä

source: No rewards to buy yet
fi: Ei vielä ostettavia esinettä

source: Parental password
fi: Vanhempien salasana

# fourDigits
source: 4 digits
fi: 4 numeroa

source: Wrong password!
fi: Väärä salasana!

source: Retry
fi: Yritä uudelleen

source: Quit
fi: Poistu

# nameItem
source: Item name
fi: Esineen nimi

source: Price
fi: Hinta

source: Save
fi: Tallenna

# itemAdd
source: Add Item
fi: Lisää esine

# textRecognized
source: Tunnistettu teksti:
fi: Recognized Text:

# screenCurrent
source: Nykyinen näyttö:
fi: Current screen:

# recordingStart
source: Aloita nauhottaminen
fi: Start Recording

# recordingStop
source: Lopeta nauhoittaminen
fi: Stop Recording

# resetText
source: Reset
fi: Tyhjennä

# about
source: About BrainyBear
fi: Tietoa BrainyBearista

# aboutText
source: Brainy Bear is an application for children and parents to make learning easy and engaging. The application is to be used under parental supervision. Application permissions required.
fi: Brainy Bear on lapsille ja vanhemmille tarkoitettu sovellus, joka tekee oppimisesta helppoa ja kiinnostavaa. Sovellusta tulee käyttää vanhempien valvonnassa. Sovelluksen käyttöön vaaditaan käyttöoikeudet.

source: Features
fi: Ominaisuudet

# mapInstructions
source: Press on map button to view nearby playgrounds
fi: Paina karttapainiketta nähdäksesi lähellä olevat leikkikentät

# mapRequirements
source: Requires location permissions. Never locate to playground without parental permission/supervision
fi: Vaatii sijaintiluvat. Älä koskaan mene leikkikentälle ilman vanhempien lupaa tai valvontaa

# drawInstructions
source: Draw and save images with built in tools
fi: Piirrä ja tallenna kuvia sisäänrakennetuilla työkaluilla

source: Stories
fi: Tarinat

# storiesInstructions
source: Read or listen to multiple stories
fi: Lue tai kuuntele useita tarinoita

# mathInstructions
source: Learn math with random generated questions and earn coins
fi: Opi matematiikkaa satunnaisten kysymysten avulla ja ansaitse kolikoita

# ARView
source: Augmented Reality View
fi: Vaihtoehtoisen todellisuuden näkymä

# ARViewInstructions
source: View the virtual buddy Brainy Bear in alternative reality
fi: Katso virtuaalista ystävää Brainy Bearia vaihtoehtoisessa todellisuudessa

# ARViewRequirements
source: Requires camera permission
fi: Vaatii luvan kameran käyttöön

source: Change parental password
fi: Vaihda vanhempien salasana

# correctAnswer
source: Answer correct ✅
fi: Oikea vastaus ✅

source: Wrong answer ❌
fi: Vastaus väärin ❌

# alertTitle
source: Hey you!
fi: Hei sinä!

# alertMessage
source: Daily playtime reached!
fi: Päivittäinen peliaika saavutettu!
